# def від слова define визначити (объявить)
def get_max(a,b): # функція визначає більше з двох чисел

    if a < b:
        print('А меньше б')
    elif a > b:
        print('А більше б')
    elif a == b:
        print('А і б рівні')
    else:
        print('Виникла помилка')
# ми об'явили функцію, яку можемо використовувати в іншій програмі
# момент з 9 по 1 рядок є об'явлення функції
# функція виконується тільки тоді, коли її просять виконатися
# нам потрібно викликати функцію
# функцію викликають з допомогою ()
# імена в момент виклику і об'явлення функції не повинні співпадати
print('Hi')

first_argument = 30
second_argument = 20
get_max(first_argument, second_argument) # викликаємо функцію, передаємо аргументи через , в функцію в ()
print('Hello')

