test_dict = {'milk': 20, 'meat': 90, 'tomato': 20} # словник

values_list = []
for i in test_dict.items():
    print(i)

# як змінним а і b обмінятися значеннями
a = 5
b = 10
c = 20
d = 30

(a, b, c, d) = (b, a, d, c) # в Python це робиться так
# елементи передані через кому, автоматично є кортежами

# в інших мовах це робиться так
# temp = b
# b = a
# a = temp

print(a, b, c, d)

my_tuple = (1, 2, 3) # кортеж замінив на список, результат той же
# записую елементи кортежа в змінні
# Це
# a = my_tuple[0]
# b = my_tuple[1]
# c = my_tuple[2]

# рівноцінно цьому
# інший варіант, записую елементи кортежа в змінні
a, b, c = my_tuple # розпаковка кортежу, цілий котеж ми розкидуємо по відповідних змінних

print(a, b, c)

# цикл for ми можемо застосовувати до списків, які містять вкладені кортежі

my_list_of_tuples = [(1, 2, 3), (2, 3, 4)]

for i in my_list_of_tuples:
    a, b, c = i # елементи кортежа розкладаємо в різні змінні
    print(a, b, c)


test_dict = {'milk': 20, 'meat': 90, 'tomato': 20} # словник

values_list = []
for k, v in test_dict.items(): # ключ розпакуємо в змінну k, значення розпакуємо в змінну v
    print(k, v)

# вивести елемент списку з індексом
my_list = [5, 2, 3, 40, 50, 12]
#my_list = [(0, 5), (1, 2), (2, 3), (3, 40), (4, 50), (5, 12)] так буде виглядати список, кортежі вкладені у список, справа це ключ індекс елемента, зліва - значення елемента.


for idx, value in enumerate(my_list): # enumerate(my_list) пертворить my_list в список кортежів, перетворить в спеціальний ітерований об'єкт
    # ми їх розділили і можемо виводити на екран окремо
    print(idx, value)




