a = 10

#'  qweqweqwe'.strip().strip().isalnum()

# звертаюсь до метода strip() у об'єкта рядок строка
# об'єкт, все що йде через крапку це метод
# в об'єкт може бути вкладений інший об'єкт, в середині об'єкта може знаходитися інша змінна.
# рядок строка це об'єкт класа str string
# все що викликається через крапку називається методом, через крапку ми можемо викликати методи до безкінечності.

print('  qweqweqwe   '.strip().capitalize().swapcase())
# print('  qweqweqwe   '.strip().capitalize())
# print('  qweqweqwe   '.strip())

# додаючи ланцюг методів ми можемо заспосовувати до об'єкта нові методи

dict(
    key1=1,
    key2=3,
    key3=4,
    key4=5
)