from tkinter import Tk, Toplevel, Button, Label, Entry, Text, END
# з модуля tkinter import Tk
# Tk це клас на основі якого ми будемо створювати наш додаток.

# ми створюємо змінну об'єкт Root, кореневе вікно, найголовніше в програмі, через яке пройдуть всі маніпуляції з іншими вікнами віджетами.
# наша програма буде виконуватися в одному великому безкінечному нескінченому циклі.

root = Tk() # викликаю Tk() як функцію, і передаємо її результат в змінну root


# txt = Text(height=10, width=256)
# аргумент height= висота, кількість рядків,
# аргумент width= 256 символів ми можемо ввести

# беремо текст який ввів користувач в entry і записуємо його в label
def get_name(): # створюємо функцію, аргументи вона приймати не буде, вона буде працювати з глобальними змінними entry і label
    label.configure(text=entry.get()) # все що ввів користувач в entry, записую в label
    entry.delete(0, END) # очищаємо entry з нульового по останній елемент, метод delete - очищає, import END
    entry.delete(2, 4)  # можна видалити 2 і 4 символ
# Метод configure потрібен для того, щоб змінювати наш об’єкт в процесі виконання.

    # створимо якусь функцію і протестуємо її
# функції для активації віджетів, передаються в конструктор цих віджетів в якості аргумента command,
# відповідно замість виклику функції передаємо саме об'єкт функції без (). Функція це об'єкт.

entry = Entry(width=256, font='Arial 20')
# font='Arial 20' змінюємо шрифт
# аргумент width= 256 символів ми можемо ввести
# аргумент show= актуальний коли хочете зробити поле для введення паролю, наприклад.
# якщо введу *, то кожен символ в цьому рядку буде відображатися як *
label = Label(text='Введіть своє ім"я і натисніть на кнопку', font='Arial 20')
# font='Arial 20' змінюємо шрифт
# віджет призначений для відображення напису
button = Button(root,
                text='Натисни на мене!',
                fg='red',
                bg='green',
                width=600,
                height=10,
                command=get_name
                )
# перший аргумент - віджет до якого прив'язана кнопка.
# 2 аргумент текст, текст який буде написаний на кнопці,
# 4 аргумент bg - колір кнопки, 16-річна система
# 3 аргумент fg - колір тексту на кнопці
# 5 аргумент font - шрифт і його розмір
# 6 аргумент width, height - ширина і довжина кнопки


root.title('Itea-Lesson-7') # написали заголовок у вікні
root.geometry('600x400') # розміри вікна: ширина 600, висота 400


label.pack() # упаковуємо label
button.pack() # упаковуємо кнопку
entry.pack(side='bottom') # аргумент side=, хочу розмістити entry внизу, bottom - низ. Також можна вліво, вправо, вверх, вниз
# упаковуємо entry
# txt.pack() # упаковуємо text
root.mainloop() # mainloop() це метод який запустить нашу програму в безкінечному циклі.
# порядок упаковки, що за чим буде у вікні, в якому порядку ви їх упакуєте, в такому порядку вони будуть відображені.

# з'явилося два вікна
# вводжу текст в вікні, тисну на кнопку, повністю введений рядок очищається

