# в цьому файлі ми проводимо нащі маніпуляції з файлами

# так відкривати файли, ця змінна буде вказувати на місце де знаходиться наш файл
# функція open() приймає наступні аргументи, назву файлу і шлях до файлу, з яким ми хочемо працювати
# якщо файли знаходяться на одному рівні, шлях прописувати не потрібно
file = open('../Lesson4/for_loop.py', 'r', encoding='utf-8') # 3.перекодовує в крилицю 2. Другий аргумент вказує режим в якому ми хочемо відкрити файл. За замовчуванням буква r тут стоїть, якщо її не поставити. 1. Перший аргумент це назва файлу.
# добавляються значення, а не перезаписуються
# line - змінна
# Читання з файлу
# for line in file:
#     print(line.strip())

# можу зчитати файл цілий але по рядках
r = file.readlines()
print(r)

# запис в файл
# for i in range(10, 20): # діапазон від 10 до 20
#     file.write(str(i)) # будемо записувати в файл


file.close()