import requests
# отримую html код сторінки сайту, зберігаю в файл, відкриваю файл
# отримую html код сторінки сайту, функція requests.get приймає першим параметром посилання, по якому потрібно зробити запит
r = requests.get('https://github.com/')
# змінна r містить в собі результат відповіді, те що повернула нам адреса під час запиту до неї

# file = open('index.html', 'w')
# ... # код, якщо в коді буде помилка файл буде не закритий
# file.close()

# конструкція контекстний менеджер
with open('index.html', 'w', encoding='utf-8') as file: # цей запис і запис вище ідентичні, файл закривається
# якщо ми працюємо з не текстовими даними, і хочемо записати ці дані, ми маємо додати букву b в режим записування: 'wb'
# write binary - записати бінарні дані
    file.write(r.text) # відповідь з браузера, з кодом сайту, запишу в файл index.html
# тут не потрібно закривати файл, ця функція автоматично закриває файл
