import pyautogui

# x, y = pyautogui.size() # поверне роздільну здатність екрану
# print(x, y)

# програма виводить на екран положення курсора, якщо його положення не таке як в попередній момент

start_pos = (0, 0) # стартова позиція 0, 0. Кортеж (0, 0), змінна start_pos
while True:
    if start_pos == pyautogui.position(): # перевіряємо, якщо попереднє положення курсора дорівнює поточному
        continue # повертаємося в початок циклу, нічого не перевіряємо
    start_pos = pyautogui.position() # призначаємо нашому стартовому значенню - нове значення
    print(start_pos)

